monsonite/SIMPL/SIMPLEX_2_MSP430FR2433_14.c
    int hex_value = 0;
    int dec_value = 0;
    int decimal_value = 0;
    char ha = 0;
    char hex_char;

    unsigned char in_byte;

    int len = 32;                        // the max length of a User word
    int length = 0;                      // number of bytes to red/write to SRAM
    int address = 0 ;                    // starting address of RAM R/W streamms
    int RAM_byte =0;                     // contents of RAM at given location
    long old_millis=0;
    long new_millis=0;
    unsigned long time = 0;
    char  name;
    char* parray;
    char* px_array;
    char* addr;
    char mode = 0x41;                  // Sequential mode for SRAM

    unsigned int num = 0;
    unsigned int num_val = 0;
//    int i;
    int j;
    int l;


//---------------------------------------------------------------------
// Initialise the USCI B for Master Mode SPI
//---------------------------------------------------------------------



void GPIO_init_2433()
{
  P1DIR = 0xFF; P2DIR = 0xFF; P3DIR = 0xFF;
  P1REN = 0xFF; P2REN = 0xFF; P3REN = 0xFF;
  P1OUT = 0x01; P2OUT = 0xFF; P3OUT = 0x17;

  // Configure GPIO

//  P2DIR |= BIT3;                          // For /FRAM_WP
//  P2OUT |= WP_PIN;  						// /FRAM_WP high

//  wpDeselect;

}


void spi_init_2433()
{




	 P3DIR |= BIT0;                          // For /RAM_CS
	 P1SEL0 |= BIT1 | BIT2 | BIT3;           // SCLK, MISO, MOSI pins


	 P3OUT |= SS_PIN;  						// /CS high

	// Configure USCI_B0

	UCB0CTLW0 |= UCSWRST;                     // **Put state machine in reset**
	UCB0CTLW0 |= UCMST|UCSYNC|UCCKPH|UCMSB;   // 3-pin, 8-bit SPI master
	                                          // Clock polarity low, MSB
	UCB0CTLW0 |= UCSSEL_2 ;                   // SMCLK
	UCB0BR0 = 0x01;                           // /2,fBitClock = fBRCLK/(UCBRx+1).
	UCB0BR1 = 0;                              //
    UCB0CTLW0 &= ~UCSWRST;                    // **Initialize USCI state machine**

}


void spi_init_4133()

{
// Configure GPIO
// P3DIR |= BIT2;                          // For /RAM_CS
 P1SEL0 |= BIT1 | BIT2 | BIT3;           // SCLK, MISO, MOSI pins

// Configure USCI_B0

    UCB0CTLW0 |= UCSWRST;                     // **Put state machine in reset**
    UCB0CTLW0 |= UCMST|UCSYNC|UCCKPH|UCMSB;   // 3-pin, 8-bit SPI master
                                              // Clock polarity low, MSB
    UCB0CTLW0 |= UCSSEL_2 ;                   // SMCLK
    UCB0BR0 = 0x01;                           // /2,fBitClock = fBRCLK/(UCBRx+1).
    UCB0BR1 = 0;                              //

    UCB0CTLW0 &= ~UCSWRST;                    // **Initialize USCI state machine**
}




//------------------------------------------------------------------------------------
// UART Initialisation
// UART provides PC comms on 1.2 and P1.2 - uses USCI A


void uart_init_2433(void)

{

  // Configure UART pins
  P1SEL0 |= BIT4 | BIT5;                    // set 2-UART pin as second function

  // Configure UART
  UCA0CTLW0 |= UCSWRST;
  UCA0CTLW0 |= UCSSEL__SMCLK;

  // Baud Rate calculation
  // 8000000/(16*9600) = 52.083
  // Fractional portion = 0.083
  // User's Guide Table 14-4: UCBRSx = 0x49
  // UCBRFx = int ( (52.083-52)*16) = 1
  UCA0BR0 = 4;                             // 8000000/16/115200
  UCA0BR1 = 0x00;
  UCA0MCTLW = 0x55 | UCOS16 | UCBRF_1;

  UCA0CTLW0 &= ~UCSWRST;                    // Initialize eUSCI
//  UCA0IE |= UCRXIE;                         // Enable USCI_A0 RX interrupt

//  __bis_SR_register(LPM3_bits|GIE);         // Enter LPM3, interrupts enabled
//  __no_operation();                         // For debugger

}


void uart_init_4133(void)

{

 // Configure UART pins
  P1SEL0 |= BIT0 | BIT1;                    // set 2-UART pin as second function

  // Configure UART
  UCA0CTLW0 |= UCSWRST;
  UCA0CTLW0 |= UCSSEL__SMCLK;

  // Baud Rate calculation
  // 8000000/(16*9600) = 52.083
  // Fractional portion = 0.083
  // User's Guide Table 14-4: UCBRSx = 0x49
  // UCBRFx = int ( (52.083-52)*16) = 1
  UCA0BR0 = 52;                             // 8000000/16/9600
  UCA0BR1 = 0x00;
  UCA0MCTLW = 0x5500 | UCOS16 | UCBRF_1;

  UCA0CTLW0 &= ~UCSWRST;                    // Initialize eUSCI


}


//---------------------------------------------------------------------
// UART Primitive Routines uart_putc and uart_get_c

unsigned char uart_getc()
{
//    while (!(IFG2&UCA0RXIFG));                   // USCI_A0 RX buffer ready?

     while (!(UCA0IFG&UCRXIFG));                   // USCI_A0 RX buffer ready?
     return UCA0RXBUF;
}

void uart_putc(unsigned char c)
{
	while (!(UCA0IFG&UCTXIFG));              // USCI_A0 TX buffer ready?
  	UCA0TXBUF = c;                          // TX
}

void uart_puts(const char *str)                 // Output a string
{
     while(*str) uart_putc(*str++);
}

//------------------------------------------------------------------------
// Print a long unsigned int number

  void printlong(unsigned long num)
  {
  if (num / (unsigned long)10 != 0) printlong(num / (unsigned long)10);
  uart_putc((char)(num % (unsigned long)10) + '0');
  return;
  }
//---------------------------------------------------------------------------
// Print a CR-LF

  void crlf(void)                  // send a crlf
  {
    uart_putc(10);
//  uart_putc(13);
  }

  void print_ok()
  {uart_puts((char *)"OK\n\r"); }

 //------------------------------------------------------------------------------------
 // Initialise the ADC on the '4133

void ADC_init_4133(void)
{
}


void ADC_init_2433(void)
{
}
/*
//-------------------------------------------------------------------------------------
void SetADC10(long int INCH)
{
ADC10CTL0 =ADC10SHT_0 + ADC10ON;
if (INCH==INCH_10) ADC10CTL0 = SREF_1 + ADC10SHT_3 + REFON + ADC10ON;
ADC10CTL1=CONSEQ_0 + INCH;
ADC10AE0 |=INCH;
__bis_SR_register(GIE); // interrupts enabled
}
//-------------------------------------------------------------------------------------
void StartPWM(int Period,int Cycle,int Pout)
{
WDTCTL = WDTPW + WDTHOLD; // Stop WDT
P1DIR |= Pout; // P1.2 and P1.3 output
P1SEL |= Pout; // P1.2 and P1.3 TA1/2 options
CCR0 = Period; // PWM Period/2
CCTL1 = OUTMOD_2; // CCR1 toggle/set
CCR1 = Cycle; // CCR1 PWM duty cycle
TACTL = TASSEL_2 + MC_3; // SMCLK-TSSEL_2,ACLK-TASSEL_1,
 // MC_3,up-down mode up to TACCR0 and down
 // MC_2,Continuous count up to 0XFFFF
 // MC_1,up mode count up to TACCR0
//_BIS_SR(LPM0_bits+GIE); // Enter LPM0
}
*/

