monsonite/SIMPL/SIMPLEX_2_MSP430FR2433_14.c
      for ( l=0; l<len; l++) {
      in_byte = bufRead( parray +  (j *len )+l);          // read the array
      uart_putc(in_byte);                                 // print the character to the serial port
    }

     crlf();

   }
   for( l = 0; l <8; l++)      // add some spaces to make it more legible on the page

   {
   crlf();
   }
    break;
//----------------------------------------------------------------------------------------------------
// Conditional Code branch

    case '[':                                     // The start of a condition test
      k = x;
      start = buf;                               // remember the start position of the test
      while ((ch = *buf++) && ch != ']') {       // get the next character into ch and increment the buffer pointer *buf - evaluate the code
      }

     case ']':
    if (x) {                                    // if x is positive - go around again
     buf = start;
    }
      break;

//--------------------------------------------------------------------------
// Case Statement Selection
// Select some code from a list separated by commas

//5(0p,1p,2p,3p,4p,5p,6p)  should select 5 and print it

case '(':

      k = x;                                                 // copy x to use as the "phrase counter"
                                                             // decrement k to see whether to interpret or not
      while (k)
      {
      ch = *buf++;
      if (ch == ',')
      { k--;}
      }
      break;

      case ',':

      k--;                                              //
      while (k<0)                                       // k < 0 so skip the remaining entries in the list
      {
      ch = *buf++;                                      // skip the remaining characters
      if (ch == ')') {break;}
      }

      break;
//-----------------------------------------------------------------------------------------------------------------------------------------------
// Analogue and Digital Input and Output Group   - these add heavily to total - need to be converted to MSP430


/*
      case 'i':
      x = digitalRead(x,y);        //   read pin p
      break;


      case 'o':
      digitalWrite(d, x%2);     //  write to pin p
      break;
*/
      case 's':
//      x = ADC_Read();         //
      break;

/*
      case 'w':
 //     analogWrite(d,x);           // PWM write to pin p
      break;

*/







//-------------------------------------------------------------------
// Delays Group

    case 'm':
    delay_mS(x);
    break;

    case 'u':
    delay_uS(x);
    break;
//---------------------------------------------------------------------

    case '{':
      k = x;
      loop = buf;
      while ((ch = *buf++) && ch != '}') {
      }
    case '}':
      if (k) {
        k--;
        buf = loop;
      }
      break;


    case 'k':
      x = k;
      break;




// -----------------------------------------------------------------------------
// Launchpad LED group  support for red and green LEDs on entry level LaunchPad

      case 'w':
 {
 digitalWrite(y,x);      // Set / reset the digital pin on Port 2
 }
 break;

 case 'r':
 {
	 RAM_byte_mode(1);  //put RAM in byte mode
	 SR_writestream(x);
	 x = RWData(DUMMY_BYTE);
 }
 break;

 case 'h':
 {
 P3OUT |= BIT1;
 }
 break;

 case 'l':
 {
 P3OUT &= ~BIT1;
 }
 break;

// ----------------------------------------------------------------------

    }
  }
}

//-----------------------------------------------------------------------------
// SPI RAM Extensions to SIMPL   Test routines etc
//---------------------------------------------------------------------
//--------------------------------------------------------------------------------
// 23K256 Serial Ram functions
//--------------------------------------------------------------------------------

char SR_getMode(void) {                                    // Read the Mode of the 23K256
    ssSelect;                                                 // select
    RWData(SR_READ_STATUS); // 0x05
    char mode = RWData(DUMMY_BYTE);
    ssDeselect;                                               // de-select
    return mode;
}

void SR_setMode(char mode) {                               // Write Mode to 23K256
    ssSelect;
    RWData(SR_WRITE_STATUS); // 0x01
    RWData(mode);
    ssDeselect;
}

/*
 //This code is for the 32K x 8 variant
static inline void SR_writestream(unsigned int addr) {          // Write a stream to 23K256
    ssDeselect; // deselect if we are active
    ssSelect;
    RWData(0x02);                                           // Send command
    RWData(addr >> 8);                                      // Send upper address
    RWData(addr);                                           // Send lower address
}
static inline void SR_readstream(unsigned int addr) {             // Read a stream from 23K256
    ssDeselect;
    ssSelect;
    RWData(0x03);                                            // Send command
    RWData(addr >> 8);                                       // Send upper address
    RWData(addr);                                            // Send lower address
}

*/
//These send an extra byte for the upper address of the 1Mbit 23LC1024 devices

static inline void SR_writestream(unsigned long addr) {          // Write a stream to 23LC1024
    ssDeselect; // deselect if we are active
    ssSelect;
    RWData(0x02);                                           // Send command
    RWData(addr >> 16);                                     // Send upper address
    RWData(addr >> 8);                                      // Send middle address
    RWData(addr);                                           // Send lower address
}

static inline void SR_readstream(unsigned long addr) {             // Read a stream from 23LC1024
    ssDeselect;
    ssSelect;
    RWData(0x03);                                           // Send command
    RWData(addr >> 16);                                     // Send upper address
    RWData(addr >> 8);                                      // Send middle address
    RWData(addr);                                           // Send lower address
}

//-----------------------------------------------------------------
// SPI Send / Receive

static inline char RWData(char value)
{
    UCB0TXBUF = value;

      while (!(UCB0IFG & UCTXIFG)) {};        // wait for buffer ready

    while  (!(UCB0IFG &   UCRXIFG));        //  USCI_B0 RX  Received?
    spi_rx_data    =   UCB0RXBUF;          //  Store received data
    return  spi_rx_data;
}


char RAM_stream_mode()
{

