monsonite/SIMPL/SIMPLEX_2_MSP430FR2433_14.c
void hex_print_4(unsigned int decimal_value)
{
  int div_value = decimal_value >> 8;
  hex_print_2(div_value);
  dec_value = decimal_value - (ha << 8);
  hex_print_2(dec_value);
  uart_putc(32);                             // output a space
}

void hex_print_char(char hex_value)        //  decode the A-F numbers
{
  if (ha <=9){hex_char = '0' + ha ;}       // Digits 0-9
  if (ha >= 10) {hex_char = '7' + ha ;}    // Letters A-F
  uart_putc(hex_char);
}
//---------------------------------------------------------------------------
// RAM Block routines

void get_block(int address)

{
  int i =0;

    RAM_stream_mode();
    SR_readstream(address << 5); // start reading at address
    for (i = 0; i <64 ; ++i)
     {
       RAM_byte = RWData(DUMMY_BYTE);
       block_array[i] = RAM_byte;                 // block_array is a temporary buffer to hold current RAM block
//       uart_putc(RAM_byte);

     }
//      crlf();
}


//---------------------------------------------------------------------------------------------
void execute_block(int address)                   // Load a block and execute it
{
  get_block(address);
  run_block();
}

//---------------------------------------------------------------------------------------------
// Point the Interpreter at the code contained in block_array and let it execute it!
void run_block()

{
  textEval(px_array);            // Evaluate and execute the User's expression from External RAM
}
//---------------------------------That's All Folks---------------------------------------------
// Apart for this support for the 6 digit LCD on the MSP430FR4133 LaunchPad
 /*
void LCD_print_4133(void)
{
   // Configure LCD pins
    SYSCFG2 |= LCDPCTL;                                        // R13/R23/R33/LCDCAP0/LCDCAP1 pins selected
    LCDPCTL0 = 0xFFFF;
    LCDPCTL1 = 0x07FF;
    LCDPCTL2 = 0x00F0;                                         // L0~L26 & L36~L39 pins selected
    LCDCTL0 = LCDSSEL_0 | LCDDIV_7;                            // flcd ref freq is xtclk
    // LCD Operation - Mode 3, internal 3.08v, charge pump 256Hz
    LCDVCTL = LCDCPEN | LCDREFEN | VLCD_6 | (LCDCPFSEL0 | LCDCPFSEL1 | LCDCPFSEL2 | LCDCPFSEL3);
    LCDMEMCTL |= LCDCLRM;                                      // Clear LCD memory
    LCDCSSEL0 = 0x000F;                                        // Configure COMs and SEGs
    LCDCSSEL1 = 0x0000;                                        // L0, L1, L2, L3: COM pins
    LCDCSSEL2 = 0x0000;
    LCDM0 = 0x21;                                              // L0 = COM0, L1 = COM1
    LCDM1 = 0x84;                                              // L2 = COM2, L3 = COM3
    // Display "123456"
    LCDMEM[pos1] = digit[1];
    LCDMEM[pos2] = digit[2];
    LCDMEM[pos3] = digit[3];
    LCDMEM[pos4] = digit[4];
    LCDMEM[pos5] = digit[5];
    LCDMEM[pos6] = digit[6];
    LCDCTL0 |= LCD4MUX | LCDON;                                // Turn on LCD, 4-mux selected
    PMMCTL0_H = PMMPW_H;                                       // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                                  // and set PMMREGOFF
//    __bis_SR_register(LPM3_bits | GIE);                        // Enter LPM3.5
//    __no_operation();                                          // For debugger
}
void LCD_display_n(int number)
{
  LCDMEMCTL |= LCDCLRM;                                      // Clear LCD memory
    LCDCSSEL0 = 0x000F;                                        // Configure COMs and SEGs
    LCDCSSEL1 = 0x0000;                                        // L0, L1, L2, L3: COM pins
    LCDCSSEL2 = 0x0000;
    LCDM0 = 0x21;                                              // L0 = COM0, L1 = COM1
    LCDM1 = 0x84;                                              // L2 = COM2, L3 = COM3
    // Display "123456"
    int n = number / 100000;
    LCDMEM[pos1] = digit[n];
    n = number - (100000*n);
    n = n/10000;
    LCDMEM[pos2] = digit[n];
    n = number - (10000*n);
    n = n/1000;
    LCDMEM[pos3] = digit[n];
      n = number - (1000*n);
    n = n/100;
    LCDMEM[pos4] = digit[n];
     n = number - (100*n);
    n = n/10;
    LCDMEM[pos5] = digit[n];
     n = number - (10*n);
    LCDMEM[pos6] = digit[n];
    LCDCTL0 |= LCD4MUX | LCDON;                                // Turn on LCD, 4-mux selected
}
*/

// That really is all!

